{
  "kind": "build_request",
  "title": "Fix blank/error screen when using Escalation actions by correcting escalation ID wiring",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the Escalations list 'Actions' (e.g., View/details navigation) so that it uses the backend-provided escalation identifier rather than a UI-generated index, preventing navigation to non-existent escalations and resulting error/blank screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Looks like there is an issue when you try to click on the actions for an escalation, you get an error or blank screen"
        ]
      },
      "acceptanceCriteria": [
        "On the Escalations Dashboard, clicking the Actions/View control for any escalation always navigates to the correct Escalation Detail page for that same record.",
        "After deleting an escalation (or after any change in ordering/filtering), the Actions/View control still opens the correct escalation and never opens a different record due to index-based IDs.",
        "No runtime error or blank screen occurs when clicking Actions/View from the list page; if the escalation truly cannot be loaded, the existing readable error UI on the detail page is shown instead."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update the frontend data flow and types so that list results carry and consistently use the real escalation ID returned by the backend (e.g., `escalationId`) across list, detail, edit, and delete operations (routing params, React Query keys, and mutation inputs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Looks like there is an issue when you try to click on the actions for an escalation, you get an error or blank screen"
        ]
      },
      "acceptanceCriteria": [
        "The list query no longer assigns an artificial ID (such as using the array index) for escalations; it uses the backend-returned escalation identifier field.",
        "EscalationsTable receives an ID that matches the backend escalation identifier and uses it for navigation.",
        "Detail, edit, and delete operations use the same identifier value as the list and never rely on array index position.",
        "TypeScript builds without type errors related to escalation IDs after the change."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI components).",
    "Keep all backend logic in the existing single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Redesigning the Escalations table UI beyond what is required to fix the Actions/blank-screen issue.",
    "Adding new escalation fields or changing backend persistence/schema as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}